Autodesk.Revit.DB.Events.GetProjectsRequestedEventArgs.GetProjects
gets CloudProject values within Event.
Since:
2019

Autodesk.Revit.DB.Events.GetProjectsRequestedEventArgs.SetProjects(System.Collections.Generic.IList{Autodesk.Revit.DB.ForgeDM.CloudProject})
Sets CloudProject values within Event.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.Events.GetProjectsRequestedEventArgs.HubId
Identifier for CloudHub
Since:
2019

Autodesk.Revit.DB.Events.GetProjectsRequestedEventArgs.#ctor(System.String)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.Events.GetProjectsRequestedEventArgs
Event arguments used by the ForgeDM Projects event.
Represents Identifier of current Hub.
Sets CloudProject values within Event.
Gets CloudProject values within Event.
Since:
2019